tests/performance/baseline.yml
config:
  target: "https://n8n.bacelardigital.tech"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Ramp up"
    - duration: 60
      arrivalRate: 2
      name: "Sustained load"
  defaults:
    headers:
      Authorization: "Bearer YOUR_AUTH_TOKEN_HERE"
  variables:
    userId: "5610e481-186e-4ec1-89aa-775c5214bdfc"

scenarios:
  - name: "Baseline Performance Test"
    flow:
      - get:
          url: "/webhook/get-user-ideas?user_id={{ userId }}"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 1
      - get:
          url: "/webhook/get-persona?user_id={{ userId }}"
          expect:
            - statusCode: 200
      - think: 1